20250315T133728--kdoc-346-appendで先頭に追加する__wiki.org
:properties:
:ID: 20250315T133728
:mtime:    20250502070602
:ctime:    20250315133816
:end:
#+title:      KDOC 346: appendで先頭に追加する
#+date:       [2025-03-15 Sat 13:37]
#+filetags:   :wiki:
#+identifier: 20250315T133728

* この文書のステータス
- 作成
  - [X] 2025-04-28 貴島
- レビュー
  - [X] 2025-05-02 貴島

* 概要

Go言語の組み込み関数 ~append~ にはさまざまな利用法がある。スライスの末尾でなく前に追加するにはこうする。

#+begin_src go :results output
  import "fmt"
    func main() {
          origin := []string{"world"}
          origin = append([]string{"hello"}, origin...)
          fmt.Print(origin)
  }
#+end_src

#+RESULTS:
#+begin_src
[hello world]
#+end_src

#+begin_src git-permalink
https://github.com/golang/go/blob/3c3b8dd4f0590881f7010014985d05cce1c9e943/src/builtin/builtin.go#L149
#+end_src

#+RESULTS:
#+begin_src
func append(slice []Type, elems ...Type) []Type
#+end_src

appendは最初にスライス、次に要素を指定する。最初に追加するには最初のスライスを新しく作り、その後ろに既存のスライスの要素を指定する、というようにする。

* 関連
- [[id:20241010T004623][KDOC 253: GoでN段階に可変長引数を渡す]]。appendの利用法つながり
