20250315T133728--kdoc-346-appendで先頭に追加する__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:18:43Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 346: appendで先頭に追加する</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 346: appendで先頭に追加する</h1>
<div id="outline-container-org1764c18" class="outline-2">
<h2 id="org1764c18"><a href="#org1764c18">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org1764c18">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-04-28 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-05-02 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7660294" class="outline-2">
<h2 id="org7660294"><a href="#org7660294">概要</a></h2>
<div class="outline-text-2" id="text-org7660294">
<p>
Go言語の組み込み関数 <code>append</code> にはさまざまな利用法がある。スライスの末尾でなく前に追加するにはこうする。
</p>

<div class="org-src-container">
<pre class="src src-go">import "fmt"
  func main() {
        origin := []string{"world"}
        origin = append([]string{"hello"}, origin...)
        fmt.Print(origin)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">[hello world]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/golang/go/blob/3c3b8dd4f0590881f7010014985d05cce1c9e943/src/builtin/builtin.go#L149
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">func append(slice []Type, elems ...Type) []Type
</pre>
</div>

<p>
appendは最初にスライス、次に要素を指定する。最初に追加するには最初のスライスを新しく作り、その後ろに既存のスライスの要素を指定する、というようにする。
</p>
</div>
</div>
<div id="outline-container-org3b7ee28" class="outline-2">
<h2 id="org3b7ee28"><a href="#org3b7ee28">関連</a></h2>
<div class="outline-text-2" id="text-org3b7ee28">
<ul class="org-ul">
<li><a href="20241010T004623--kdoc-253-goでn段階に可変長引数を渡す__wiki.html#ID-20241010T004623">KDOC 253: GoでN段階に可変長引数を渡す</a>。appendの利用法つながり</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
